Repository: archcore-ai/archcore.ai
Catalog: src/locales/*/messages.po
Languages: ru

source: "Why did we choose microservices?" → Instant ADR lookup
ru: PRD, RFC, ADR помогут разобраться в причинах решений

source: "Why microservices?"
ru: "Почему микросервисы?"

source: (Connection Pooling Policy). This leads to database connection limit exhaustion during scaling.
ru: (Connection Pooling Policy). Это приводит к исчерпанию лимита подключений базы данных при масштабировании.

source: ), as defined in GUIDE-012.
ru: ), как определено в GUIDE-012.

source: ✓ AI follows architectural rules
ru: ✓ ИИ следует архитектурным правилам

source: ✓ Deterministic retrieval
ru: ✓ Детерминированное извлечение

source: ✓ Finds information across apps
ru: ✓ Находит информацию в разных приложениях

source: ✓ Great for "what did we discuss?"
ru: ✓ Отлично для "что мы обсуждали?"

source: ✓ Makes intent an enforceable contract
ru: ✓ Превращает намерения в исполняемый контракт

source: ✓ Structured, governed, versioned
ru: ✓ Структурировано, управляемо, версионировано

source: ✓ Traceable to sources
ru: ✓ Отслеживаемо до источников

source: ✗ Can't enforce constraints
ru: ✗ Не может обеспечить соблюдение ограничений

source: ✗ No architectural structure
ru: ✗ Нет архитектурной структуры

source: ✗ Results vary by query phrasing
ru: ✗ Результаты зависят от формулировки запроса

source: 60% fewer violations reach main
ru: На 60% меньше нарушений соглашений

source: 75% less architectural rework
ru: На 75% меньше архитектурных переделок

source: Access policy, versioning
ru: Политики доступа, версионирование

source: ADR-009: Decided to decompose by bounded contexts. Constraints: autonomous data schemas, contract-based interaction via HTTP/Async API, backward compatibility ≥ 2 releases.
ru: ADR-009: Принято решение о декомпозиции по bounded contexts. Ограничения: автономные схемы данных, контрактное взаимодействие через HTTP/Async API, обратная совместимость ≥ 2 релиза.

source: AI agents generate code following your current architectural standards, not deprecated patterns.
ru: ИИ-агенты генерируют код по актуальной документации

source: AI sees fragments, not the system. Impossible to understand how pieces connect.
ru: ИИ видит куски, а не систему. Невозможно понять, как части связаны друг с другом.

source: AI Tools
ru: ИИ-инструменты

source: AI: …analyzing…
ru: ИИ: …анализ…

source: Answer
ru: Ответ

source: Answers with citations to specific decisions
ru: Ответы с цитатами на конкретные решения

source: Apply
ru: Применять

source: Archcore clones your repository and builds an initial knowledge graph. You can create global documents shared across multiple projects.
ru: Archcore клонирует ваш репозиторий и строит первичный граф знаний. Вы можете создавать глобальные документы общие для нескольких проектов.

source: Archcore demo
ru: Демо Archcore

source: Archcore gathers architectural decisions from code, ADRs, and discussions, transforms them into an Architecture Record (versioned contract), and delivers it to IDEs/chats/agents via MCP — with traceable sources.
ru: Archcore помогает командам строить точный технический контекст для улучшения работы AI агентов

source: Archcore runs entirely on your infrastructure — no SaaS, no data export, no third-party AI vendors required. Keep your code and architectural knowledge inside your security perimeter.
ru: Archcore работает полностью на вашей инфраструктуре — без SaaS, без экспорта данных. Храните код и архитектурные знания внутри вашего периметра безопасности.

source: Architectural decisions with rationale: why this approach, what were alternatives.
ru: Архитектурные решения с обоснованием: почему выбрали этот подход, какие были альтернативы.

source: Architectural standards enforcement during code review, not after merge.
ru: Неявные знания команды о коде доступны ИИ агенту для более глубокой проверки

source: Architecture Record
ru: Архитектурная запись

source: Architecture Record as enforceable contract
ru: Архитектурная запись как исполняемый контракт

source: Auto-detect pattern violations against ADRs
ru: Выражайте неявные правила в слое знаний Archcore (гайды и правила)

source: Boundaries
ru: Границы

source: Can Archcore be deployed on-premises for my organization?
ru: Можно ли развернуть Archcore локально (on-premises) для моей организации?

source: Can I use Archcore with local LLMs instead of cloud providers?
ru: Можно ли использовать Archcore с локальной LLM?

source: Can we control what context AI tools can access?
ru: Можем ли мы контролировать, какой контекст видят ИИ-инструменты?

source: Code + ADRs + discussions
ru: Код + ADR + обсуждения

source: Code Generation
ru: Генерация кода

source: Code Review
ru: Код-ревью

source: Code review criteria for architectural compliance.
ru: Критерии проверки кода на соответствие архитектурным требованиям.

source: Connects to Your Architecture Sources
ru: Платформа контекстной инженерии

source: Constraints (must/never)
ru: Ограничения (must/never)

source: Contact Us
ru: Связаться с нами

source: Context engineering platform for teams
ru: Платформа контекстной инженерии для команд

source: Context fragmentation is the root cause of AI hallucinations and architectural drift.
ru: Фрагментация контекста — это основная причина галлюцинаций ИИ и архитектурного дрейфа.

source: Context scattered across code, docs, and chats
ru: Контекст рассыпан по коду, докам и чатам

source: Context-aware answers for architecture questions
ru: Ответы на архитектурные вопросы с учётом контекста

source: Context-aware code generation aligned with ADRs
ru: Кратное повышение эффективности режима планирования ИИ агента

source: Conventions are easily ignored when not structured. No automatic validation.
ru: Соглашения легко игнорируются, когда они не структурированы. Нет автоматической проверки.

source: Copilot, Cursor, Claude, and other AI agents generate code from patterns in public repositories. Archcore serves as a context source and complements the AI agent's knowledge. In other words, Archcore is the persistent memory of your project.
ru: Copilot и Cursor, Claude и другие ИИ агенты генерируют код по паттернам из публичных репозиториев. Archcore является источником контекста и дополняет знания ИИ агента. Другими словами Archcore это постоянная память вашего проекта.

source: Create knowledge base, rules, and documentation linked to code. Each link between source code and documentation dramatically improves AI understanding of the project.
ru: Создавайте базу знаний, правила и документацию связанную с кодом. Каждая связь исходного кода с фрагментом документа кратно увеличивает понимание ИИ проекта

source: Decision rationale, constraints, and current state in seconds
ru: Обоснование решений, ограничения и текущее состояние — за секунды

source: Decisions (ADR)
ru: Решения (ADR)

source: Demo
ru: Демо

source: Demo is read-only. Creating/editing records available in self-hosted installation.
ru: Демо — только просмотр. Создание/изменение записей доступно в self-hosted установке.

source: Deployed Archcore system connects to any AI agent that supports MCP (Model Context Protocol). Nearly every editor or terminal allows you to run AI agents for your tasks: Cursor, VSCode, Warp, and others.
ru: Развернутая система Archcore подключается к любому ИИ агенту, который поддерживает MCP (Model Context Protocol). Практически редактор или терминал позволяет запускать ИИ агентов для ваших задач: Cursor, VSCode, Warp и др.

source: Direct connection creation violates
ru: Прямое создание соединений нарушает

source: Do I need to rewrite our existing documentation?
ru: Нужно ли переписывать нашу документацию?

source: Docker-ready
ru: Docker образ

source: Documentation and Code
ru: Документация и код

source: Does Archcore integrate with AI agents via MCP?
ru: Интегрируется ли Archcore с AI-агентами через MCP?

source: Domain terms and definitions, team's ubiquitous language.
ru: Термины и определения предметной области, единый язык команды.

source: Enter your work email
ru: Введите рабочий email

source: Enterprise Search (like Onyx)
ru: Корпоративный поиск (как Onyx)

source: Example of how the system works with real open-source project <0>hotpot-tracker</0>
ru: Пример работы системы с реальным open-source проектом <0>hotpot-tracker</0>

source: Examples / Anti-examples
ru: Примеры / Антипримеры

source: Explore how Archcore structures, versions, and enforces architectural context
ru: Изучите, как Archcore структурирует, версионирует и применяет архитектурный контекст

source: Faster Onboarding
ru: Быстрый онбординг

source: Faster onboarding: "why did we do this?" → answer + link to decision/ADR.
ru: Архитектурные решения превращаются в долговременную память команды.

source: Fewer PR iterations: AI considers module boundaries, patterns, and constraints before writing code.
ru: Ускоряет и делает более точной работу AI агентов

source: for all AI tools
ru: для AI-инструментов

source: Frequently Asked Questions
ru: Часто задаваемые вопросы

source: Gather
ru: Собрать

source: Gather → Record → Apply → Verify
ru: Собрать → Зафиксировать → Применять → Проверять

source: Glossary
ru: Глоссарий

source: Hard rules: what must be done, what is strictly forbidden in the codebase.
ru: Жёсткие правила: что обязательно делать, что категорически запрещено в кодовой базе.

source: How can I use Archcore in code editors?
ru: Как можно использовать Archcore в редакторах кода?

source: How is Archcore different from GitHub Copilot or Cursor?
ru: Чем Archcore отличается от GitHub Copilot или Cursor?

source: How teams use Archcore to solve architectural context challenges
ru: Как команды используют Archcore для решения проблем архитектурного контекста

source: IDEs/chats/agents get context via MCP
ru: IDE/чаты/агенты получают контекст через MCP

source: Integration
ru: Подключение

source: Interactive Tour
ru: Интерактивный тур

source: Links reviewers directly to relevant architectural decisions
ru: Помогает команде влиять на качество ответов ИИ агентов

source: Local LLMs supported
ru: Поддержка локальных LLM

source: MCP protocol allows connecting any tools and integrations: code editors, bots, etc. Update documentation and get instant feedback.
ru: Протокол MCP позволяет подключить любые ваши инструменты и интеграции: редакторы кода, боты и др. Корректируйте документацию и получайте мгновенную обратную связь

source: MCP-native
ru: RAG

source: Modules, bounded contexts, interaction interfaces between components.
ru: Модули, bounded contexts, интерфейсы взаимодействия между компонентами.

source: New engineers understand architectural decisions instantly instead of spending days searching through Slack and outdated docs.
ru: Более эффективный онбординг и вопрос-ответ для новых сотрудников. Технические подробности по коду и исторические сводки решений.

source: No traceability
ru: Нет проверяемости

source: Not required. Archcore focuses on technical details - it's closer to source code and infrastructure. You can use it as another system, but exclusively for technical tasks. However, the system doesn't limit you and has sufficient functionality to keep documentation entirely within it, considering the limitations of our layers and the specifics of its purpose.
ru: Необязательно. Archcore фокусируется на технических деталях - находится ближе к исходному коду и инфраструктуре. Вы можете использовать его как еще одна система, но исключительно для технических задач. Но система вас неограничивает и имеет достаточный функционал держать документацию полностью у себя, учитывая ограничения наших слоев и специфики назначения.

source: Onboarding: 4 weeks → 1.5 weeks
ru: Онбординг: 4 недели → 1,5 недели

source: One architectural context
ru: Общий архитектурный контекст

source: PostgreSQL backend
ru: Бэкенд на PostgreSQL

source: Prevents generic AI from approving non-compliant code
ru: Не позволяет универсальному ИИ одобрять код, не соответствующий архитектуре

source: Prevents using deprecated authentication patterns
ru: Экономия токенов и уменьшение ошибок

source: Private. Self-hosted. Yours.
ru: Self-hosted. Работает в вашей инфраструктуре.

source: Product
ru: Продукт

source: Provides current OAuth2 standard to coding agents
ru: Сбор контекста из нескольких репозиториев

source: Q/A, onboarding
ru: Онбординг, Q/A

source: Question
ru: Вопрос

source: Quick start
ru: Запуск за 1 день

source: Real Use Cases
ru: Реальные сценарии использования

source: Recommendation: Use connection pool (
ru: Рекомендация: Используйте пул соединений (

source: Record
ru: Зафиксировать

source: Reliable AI Code Generation
ru: Надёжная генерация кода с ИИ

source: Request Pilot
ru: Запросить пилот

source: Review Checklists
ru: Чеклисты проверки

source: RFC-017: Monolithic architecture identified as bottleneck for parallel development. Key issues: blocking releases, high domain coupling, average change delivery cycle > 14 days.
ru: RFC-017: Монолитная архитектура признана узким местом для параллельной разработки. Основные проблемы: блокирующие релизы, высокая связность доменов, средний цикл поставки изменений > 14 дней.

source: Rules applied
ru: Применённые правила

source: Rules aren't enforced
ru: Правила не исполняются

source: Run demo
ru: Запустить демо

source: Safer Code Review
ru: Глубокая проверка кода

source: Safer code review: changes are validated against architectural constraints.
ru: Контекст ИИ под контролем — для кодревью, онбординга и любых автоматизаций.

source: Samples of correct and incorrect code for specific patterns.
ru: Образцы правильного и неправильного кода для конкретных паттернов.

source: See the Architecture Record in action
ru: Посмотрите Architecture Record в действии

source: Source Code
ru: Исходный код

source: Sources
ru: Источники

source: Sources used
ru: Использованные источники

source: Start with what you already have: code, ADRs, documentation, discussions. Connectors gather context into a unified Architecture Record.
ru: Начните с того, что у вас уже есть: создавайте документацию в Archcore и связывайте ее с вашим кодом

source: Stay Updated
ru: Будьте в курсе

source: Still have questions?
ru: Остались вопросы?

source: Structured, versioned, queryable
ru: Структурировано, версионировано, запрашиваемо

source: Subscribe
ru: Подписаться

source: Thanks! You're on the list.
ru: Спасибо! Вы в списке рассылки.

source: The 4-stage architectural knowledge pipeline that powers consistent AI context.
ru: 4-этапный пайплайн архитектурных знаний, обеспечивающий консистентный контекст для ИИ.

source: The answer to: 'what exactly do you store?' Six types of architectural knowledge.
ru: Ответ на вопрос: 'а что именно вы храните?' Шесть типов архитектурных знаний.

source: The Model Isn't 'Bad'. The Context Is Incomplete.
ru: LLM модель не "плохая". Контекст — неполный.

source: Traceable reasoning: No black box
ru: Отслеживаемое рассуждение: без чёрного ящика

source: Try Archcore in Action
ru: Попробуйте Archcore в действии

source: Use cases
ru: Примеры

source: User: Why did we move away from the monolith?
ru: Пользователь: Почему мы отказались от монолита?

source: Verify
ru: Проверять

source: We moved away from the monolith because team velocity became limited by architecture, not people. Moving to services enabled independent deployments, reduced blast radius of errors, and aligned responsibility by domains. The decision consciously increases operational complexity but is considered acceptable at current scale.
ru: Мы отказались от монолита, потому что скорость команд стала ограничиваться архитектурой, а не людьми. Переход к сервисам позволил выпускать изменения независимо, сократить blast radius ошибок и выровнять ответственность по доменам. Решение осознанно увеличивает операционную сложность, но считается приемлемым при текущем масштабе.

source: What is Architecture Record
ru: Что такое Architecture Record

source: With citations
ru: С цитатами

source: Without sources and versions, impossible to understand 'why AI decided this' or verify correctness.
ru: Без источников и версий невозможно понять 'почему ИИ так решил' или проверить корректность.

source: Works with local LLMs
ru: Поддержка локальных LLM

source: Yes, Archcore can be integrated with AI agents via MCP. This allows you to connect Cursor, Claude Code, and other tools to the Archcore platform, enriching your project context with deep knowledge of architectural decisions and constraints.
ru: Да, Archcore можно интегрировать с AI-агентами через MCP. Это позволяет подключать Cursor, Claude Code и другие инструменты к платформе Archcore, обогащая контекст ваших проектов глубокими знаниями об архитектурных решениях и ограничениях.

source: Yes, Archcore is compatible with local LLMs such as Llama 3, Qwen 2, and others via Ollama or LM Studio. You can flexibly configure embeddings and chat with different models separately.
ru: Да, Archcore совместим с локальными LLM, такими как Llama 3, Qwen 2 и другими через Ollama или LM Studio. Вы можете гибко настраивать отдельно embeddings и чат разными моделями.

source: Yes, you can deploy Archcore entirely within your infrastructure and even use your own LLM providers for greater flexibility. This option allows you to maintain complete confidentiality and security of your Architecture Record. Available only for enterprise customers—contact us for more information.
ru: Да, вы можете развернуть Archcore полностью в своей инфраструктуре и даже использовать собственных LLM-провайдеров для большей гибкости. Эта опция позволяет сохранить полную конфиденциальность и безопасность вашей Архитектурной записи. Доступно только для корпоративных клиентов — свяжитесь с нами для получения дополнительной информации.

source: Yes. When connecting your system via MCP, you can specify specific projects you want to work with. Additionally, we can refine context with tags for filtering.
ru: Да. При подключении через MCP вашей системы вы можете указать конкретные проекты с которыми хотите работать. Кроме этого мы можем уточнять теги для фильтрации контекста.
